[
  {
    "id": 1,
    "nome": "Angola-Api",
    "descricao": "Uma API abrangente que fornece dados detalhados sobre a geografia de Angola, incluindo informações sobre províncias, municípios e comunas. Ideal para desenvolvedores que necessitam de dados geográficos precisos para aplicações focadas em Angola.",
    "linguagem": "Typescript",
    "estrela": 251,
    "link": "https://github.com/VagneLelo/Angola-Api"
  },
  {
    "id": 2,
    "nome": "user_crud",
    "descricao": "API RESTful robusta desenvolvida com Node.js, Express e MongoDB. Implementa autenticação segura com JWT, criptografia de senhas e operações completas de CRUD (Create, Read, Update, Delete) para gerenciamento de usuários.",
    "linguagem": "Node.js",
    "estrela": 1,
    "link": "https://github.com/VagneLelo/user_crud"
  },
  {
    "id": 3,
    "nome": "upload_multy_files_api",
    "descricao": "Solução backend eficiente para upload e gerenciamento de múltiplos arquivos simultaneamente. Utiliza Node.js e a biblioteca Multer para processamento de arquivos, com armazenamento de metadados no MongoDB.",
    "linguagem": "Node.js",
    "estrela": 2,
    "link": "https://github.com/VagneLelo/upload_multy_files_api"
  },
  {
    "id": 4,
    "nome": "devfolio",
    "descricao": "Portfólio pessoal interativo e responsivo, construído com HTML5 semântico e CSS3 moderno. Apresenta projetos, habilidades e informações de contato com um design limpo e animações suaves para uma excelente experiência do usuário.",
    "linguagem": "HTML/JavaScript",
    "estrela": 0,
    "link": "https://github.com/VagneLelo/devfolio"
  },
  {
    "id": 5,
    "nome": "otaku-anime-object-generator",
    "descricao": "Ferramenta divertida e útil para gerar objetos JSON aleatórios relacionados a animes. Perfeito para popular bancos de dados de teste, criar mocks para front-end ou simplesmente para uso em aplicações temáticas de anime.",
    "linguagem": "JavaScript",
    "estrela": 0,
    "link": "https://github.com/VagneLelo/otaku-anime-object-generator"
  }
]
